In this chapter, we'll imagine a small language that provides us all the critical features of Infrastructure as Logic.

We will explicitly avoid:
* Pulling state of real-world infrastructure
* Parsing terraform or any other IaC
* Deploying anything

What we will build in this chapter is the core `ial` language, using Prolog as our base.

There are a number of logic programming languages out there; Datalog, miniKanren, Mercury - so why Prolog?

If you're from an academic computer science background, you're likely already somewhat familiar with Prolog. It's the prototypical logic programming language, and has by far the most resources available to learn.

## Resources
The core concept in Infrastructure as Code is the **Resource**. A Resource is data that represents an existing or potential object in some system. This definition is a little vague, because a resource can be anything from a file on a local machine to a VM on a cloud platform.

Resources are usually associated with a name or id so they can be referenced in the definitions of other resources, and a type that defines what kind of resource is being specified.

Consider the following terraform example:

```terraform
resource "aws_s3_bucket" "example" {
  bucket = "my-tf-test-bucket"

  tags = {
    Name        = "My bucket"
    Environment = "Dev"
  }
}
```

In this example:
* The *Name* is `example`
* The *Type* is `aws_s3_bucket`
* The *Params* are the bucket name, and the dictionary of tags

All resources can be distilled down to this triple of *Name*, *Type*, and *Params*.

We can represent the above example in Prolog like this:
```prolog
resource(example, aws_s3_bucket, _{
            bucket: "my-tf-test-bucket",
            tags: _{
              Name: "My bucket",
              Environment: "Dev"
        }}).
```

Here we have defined a **fact** stating that there is a resource with the name, type, and params provided. We can interrogate this program to ask questions about our resources:
```prolog
% What is the type of the resource 'example'?
?- resource(example, TYPE, _).
TYPE=aws_s3_bucket

% What are the names of all aws_s3_buckets?
?- resource(NAME, aws_s3_bucket, _).
NAME=example

% What are the names and types of any resources with the bucket name "my-tf-test-bucket"?
?- resource(NAME, TYPE, _PARAMS), get_dict(bucket_name, _PARAMS, "my-tf-test-bucket").
NAME=example
TYPE=aws_s3_bucket
```

As you can see, we can structurally interrogate the resources we have defined. This makes it possible to filter and search through our resources based on any of its properties.

### Helpers
We can quite easily extend resources by defining helpers. Consider the s3 bucket example above.

We can define a shorthand for querying s3 buckets:
```prolog
aws_s3_bucket(NAME, PARAMS) :-
	resource(NAME, s3_bucket, PARAMS).
```

And another for defining them:
```
resource(NAME, aws_s3_bucket, PARAMS) :-
    s3_bucket(NAME, PARAMS).
```

Now, we can declare our bucket using `s3_bucket`:
```prolog
aws_s3_bucket(example, _{ ... }).

?- aws_s3_bucket(NAME, _).
NAME=example.

?- resource(NAME, TYPE, _).
NAME=example,
TYPE=aws_s3_bucket
```

This doesn't add any functionality, but it is a bit more ergonomic.

## Changesets
To be useful as an IaC tool, we need to be able to compute a changeset. What do we have to change in order to make this code true? We only need to alter the resources that have changed -- anything else is a waste of time.

We need some notion of what exists versus what is desired to achieve this. Let's extend `resource` with a concept of time:
```prolog
% Any bare resources are marked as 'desired'
resource(desired, NAME, TYPE, PARAMS) :-
    resource(NAME, TYPE, PARAMS).
```

There are two states we care about here for the `T` value - `desired` and `existing`. `desired` resources are resources that we want to exist. `existing` resources are those that already exist.

### Calculating changesets
Let's start with our s3 bucket, and say we want to change a tag on it:
```prolog
resource(existing, example, aws_s3_bucket, _{ ..., tags: _{ smells: bad }}).
resource(desired, example, aws_s3_bucket, _{ ..., tags: _{ smells: good }}).
```

TODO keep going!
